#+title: hl-sentence-long-lines
#+author: James Dyer
#+email: captainflasmr@gmail.com
#+language: en
#+options: ':t toc:nil author:nil email:nil num:nil title:nil
#+todo: TODO DOING | DONE
#+startup: showall

* Customization

#+begin_src emacs-lisp :results table :colnames '("Custom variable" "Description") :exports results
  (let ((rows))
    (mapatoms
     (lambda (symbol)
       (when (and (string-match "^hl-sentence-long-"
                                (symbol-name symbol))
                  (not (string-match "--" (symbol-name symbol)))
                  (or (custom-variable-p symbol)
                      (boundp symbol)))
         (push `(,symbol
                 ,(car
                   (split-string
                    (or (get (indirect-variable symbol)
                             'variable-documentation)
                        (get symbol 'variable-documentation)
                        "")
                    "\n")))
               rows))))
    rows)
#+end_src

#+RESULTS:
| Custom variable                            | Description                                                               |
|--------------------------------------------+---------------------------------------------------------------------------|
| hl-sentence-long-lines-highlighting-toggle | When non-nil, the `hl-sentence-long-lines-highlighting-toggle` is active. |
| hl-sentence-long-lines-word-limit          | The word limit for highlighting long sentences.                           |
| hl-sentence-long-lines-word-count-str      | String to display the current sentence word count in the mode line.       |
| hl-sentence-long-lines-mode                | Non-nil if Hl-Sentence-Long-Lines mode is enabled.                        |
| hl-sentence-long-lines-sentence-toggle     | When non-nil, the `hl-sentence-long-lines-sentence-toggle` is active.     |
| hl-sentence-long-lines-mode-hook           | Hook run after entering or leaving `hl-sentence-long-lines-mode'.         |
| hl-sentence-long-lines-word-count-toggle   | When non-nil, the `hl-sentence-long-lines-word-count-toggle` is active.   |
| hl-sentence-long-lines-extent              | The location of the hl-sentence-long-lines-mode overlay.                  |

* Commands

#+BEGIN_SRC emacs-lisp :results table :colnames '("Command" "Description") :exports results
    (let ((rows))
      (mapatoms
       (lambda (symbol)
         (when (and (string-match "^hl-sentence-long-"
                                  (symbol-name symbol))
                    (commandp symbol))
           (push `(,(string-join
                     (seq-filter
                      (lambda (symbol)
                        (not (string-match "menu" symbol)))
                      (mapcar
                       (lambda (keys)
                         (key-description keys))
                       (or
                        (where-is-internal
                         (symbol-function symbol)
                         comint-mode-map
                         nil nil (command-remapping 'comint-next-input))
                        (where-is-internal
                         symbol ready-player-major-mode-map nil nil (command-remapping symbol))
                        (where-is-internal
                         (symbol-function symbol)
                         ready-player-major-mode-map nil nil (command-remapping symbol)))))  " or ")
                   ,(symbol-name symbol)
                   ,(car
                     (split-string
                      (or (documentation symbol t) "")
                      "\n")))
                 rows))))
      rows)
#+END_SRC

#+RESULTS:
|       | hl-sentence-long-lines-toggle-word-count   | Toggle word count on modeline.               |
|       | hl-sentence-long-lines-mode                | Enable highlighting of the current sentence. |
|       | hl-sentence-long-lines-toggle-highlighting | Toggle sentence long highlighting.           |
| C-c l | hl-sentence-long-lines-transient           | Sentence Highlighting Transient Commands.    |
|       | hl-sentence-long-lines-toggle-sentence     | Toggle the sentence highlighting.            |

